TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_fsi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_CRC_INFO register
//
//*************************************************************************************************
#define FSI_RX_CRC_INFO_RX_CRC_S     0U
#define FSI_RX_CRC_INFO_RX_CRC_M     0xFFU     // Received CRC Value
#define FSI_RX_CRC_INFO_CALC_CRC_S   8U
#define FSI_RX_CRC_INFO_CALC_CRC_M   0xFF00U   // Hardware Calculated CRC

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_EVT_CLR register
//
//*************************************************************************************************
#define FSI_RX_EVT_CLR_PING_WD_TO        0x1U      // Ping Watchdog Timeout Flag Clear
#define FSI_RX_EVT_CLR_FRAME_WD_TO       0x2U      // Frame Watchdog Timeout Flag Clear
#define FSI_RX_EVT_CLR_CRC_ERR           0x4U      // CRC Error Flag Clear
#define FSI_RX_EVT_CLR_TYPE_ERR          0x8U      // Frame Type Error Flag Clear
#define FSI_RX_EVT_CLR_EOF_ERR           0x10U     // End-of-Frame Error Flag Clear
#define FSI_RX_EVT_CLR_BUF_OVERRUN       0x20U     // Receive Buffer Overrun Flag Clear
#define FSI_RX_EVT_CLR_FRAME_DONE        0x40U     // Frame Done Flag Clear
#define FSI_RX_EVT_CLR_BUF_UNDERRUN      0x80U     // Receive Buffer Underrun Flag Clear
#define FSI_RX_EVT_CLR_ERR_FRAME         0x100U    // Error Frame Received Flag Clear
#define FSI_RX_EVT_CLR_PING_FRAME        0x200U    // PING Frame Received Flag Clear
#define FSI_RX_EVT_CLR_FRAME_OVERRUN     0x400U    // Frame Overrun Flag Clear
#define FSI_RX_EVT_CLR_DATA_FRAME        0x800U    // Data Frame Received Flag Clear
#define FSI_RX_EVT_CLR_PING_TAG_MATCH    0x1000U   // Ping Tag Match Flag Clear
#define FSI_RX_EVT_CLR_DATA_TAG_MATCH    0x2000U   // Data Tag Match Flag Clear
#define FSI_RX_EVT_CLR_ERROR_TAG_MATCH   0x4000U   // Error Tag Match Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_EVT_FRC register
//
//*************************************************************************************************
#define FSI_RX_EVT_FRC_PING_WD_TO        0x1U      // Ping Watchdog Timeout Flag Force
#define FSI_RX_EVT_FRC_FRAME_WD_TO       0x2U      // Frame Watchdog Timeout Flag Force
#define FSI_RX_EVT_FRC_CRC_ERR           0x4U      // CRC Error Flag Force
#define FSI_RX_EVT_FRC_TYPE_ERR          0x8U      // Frame Type Error Flag Force
#define FSI_RX_EVT_FRC_EOF_ERR           0x10U     // End-of-Frame Error Flag Force
#define FSI_RX_EVT_FRC_BUF_OVERRUN       0x20U     // Receive Buffer Overrun Flag Force
#define FSI_RX_EVT_FRC_FRAME_DONE        0x40U     // Frame Done Flag Force
#define FSI_RX_EVT_FRC_BUF_UNDERRUN      0x80U     // Receive Buffer Underrun Flag Force
#define FSI_RX_EVT_FRC_ERR_FRAME         0x100U    // Error Frame Received Flag Force
#define FSI_RX_EVT_FRC_PING_FRAME        0x200U    // Ping Frame Received Flag Force
#define FSI_RX_EVT_FRC_FRAME_OVERRUN     0x400U    // Frame Overrun Flag Force
#define FSI_RX_EVT_FRC_DATA_FRAME        0x800U    // Data Frame Received Flag Force
#define FSI_RX_EVT_FRC_PING_TAG_MATCH    0x1000U   // Ping Tag Match Flag Force
#define FSI_RX_EVT_FRC_DATA_TAG_MATCH    0x2000U   // Data Tag Match Flag Force
#define FSI_RX_EVT_FRC_ERROR_TAG_MATCH   0x4000U   // Error Tag Match Flag Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_BUF_PTR_LOAD register
//
//*************************************************************************************************
#define FSI_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_S   0U
#define FSI_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_M   0xFU   // Load value for receive buffer pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_BUF_PTR_STS register
//
//*************************************************************************************************
#define FSI_RX_BUF_PTR_STS_CURR_BUF_PTR_S    0U
#define FSI_RX_BUF_PTR_STS_CURR_BUF_PTR_M    0xFU      // Current Buffer Pointer Index
#define FSI_RX_BUF_PTR_STS_CURR_WORD_CNT_S   8U
#define FSI_RX_BUF_PTR_STS_CURR_WORD_CNT_M   0x1F00U   // Available Words in Buffer

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_FRAME_WD_CTRL register
//
//*************************************************************************************************
#define FSI_RX_FRAME_WD_CTRL_FRAME_WD_CNT_RST   0x1U   // Frame Watchdog Counter Reset
#define FSI_RX_FRAME_WD_CTRL_FRAME_WD_EN        0x2U   // Frame Watchdog Counter Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_PING_WD_CTRL register
//
//*************************************************************************************************
#define FSI_RX_PING_WD_CTRL_PING_WD_RST   0x1U   // Ping Watchdog Counter Reset
#define FSI_RX_PING_WD_CTRL_PING_WD_EN    0x2U   // Ping Watchdog Counter Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_PING_TAG register
//
//*************************************************************************************************
#define FSI_RX_PING_TAG_PING_TAG_S   1U
#define FSI_RX_PING_TAG_PING_TAG_M   0x1EU   // Ping Frame Tag

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT1_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT1_CTRL_INT1_EN_PING_WD_TO        0x1U      // Enable Ping Watchdog Timeout
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_WD_TO       0x2U      // Enable Frame Watchdog Timeout
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_CRC_ERR           0x4U      // Enable CRC Error Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_TYPE_ERR          0x8U      // Enable Frame Type Error Interrupt
                                                             // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_EOF_ERR           0x10U     // Enable End-of-Frame Error Interrupt
                                                             // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_OVERRUN           0x20U     // Enable Receive Buffer Overrun
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_DONE        0x40U     // Enable Frame Done Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_UNDERRUN          0x80U     // Enable Buffer Underrun Interrupt to
                                                             // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_ERR_FRAME         0x100U    // Enable Error Frame Received
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_PING_FRAME        0x200U    // Enable Ping Frame Received
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_OVERRUN     0x400U    // Enable Frame Overrun Interrupt to
                                                             // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_DATA_FRAME        0x800U    // Enable Data Frame Received
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_PING_TAG_MATCH    0x1000U   // Enable Ping Frame Tag Matched
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_DATA_TAG_MATCH    0x2000U   // Enable Data Frame Tag Matched
                                                             // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_ERROR_TAG_MATCH   0x4000U   // Enable Error Frame Tag Matched
                                                             // Interrupt to INT1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT2_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT2_CTRL_INT2_EN_PING_WD_TO        0x1U      // Enable Ping Watchdog Timeout
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_WD_TO       0x2U      // Enable Frame Watchdog Timeout
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_CRC_ERR           0x4U      // Enable CRC Errror Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_TYPE_ERR          0x8U      // Enable Frame Type Error Interrupt
                                                             // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_EOF_ERR           0x10U     // Enable End-of-Frame Error Interrupt
                                                             // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_OVERRUN           0x20U     // Enable Buffer Overrun Interrupt to
                                                             // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_DONE        0x40U     // Enable Frame Done Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_UNDERRUN          0x80U     // Enable Buffer Underrun Interrupt to
                                                             // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_ERR_FRAME         0x100U    // Enable Error Frame Received
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_PING_FRAME        0x200U    // Enable Ping Frame Received
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_OVERRUN     0x400U    // Enable Frame Overrun Interrupt to
                                                             // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_DATA_FRAME        0x800U    // Enable Data Frame Received
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_PING_TAG_MATCH    0x1000U   // Enable Ping Frame Tag Matched
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_DATA_TAG_MATCH    0x2000U   // Enable Data Frame Tag Matched
                                                             // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_ERROR_TAG_MATCH   0x4000U   // Enable Error Frame Tag Matched
                                                             // Interrupt to INT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_LOCK_CTRL register
//
//*************************************************************************************************
#define FSI_RX_LOCK_CTRL_LOCK    0x1U      // Control Register Lock Enable
#define FSI_RX_LOCK_CTRL_KEY_S   8U
#define FSI_RX_LOCK_CTRL_KEY_M   0xFF00U   // Write Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_DATA register
//
//*************************************************************************************************
#define FSI_RX_ECC_DATA_DATA_LOW_S    0U
#define FSI_RX_ECC_DATA_DATA_LOW_M    0xFFFFU       // ECC Data Lower 16 Bits
#define FSI_RX_ECC_DATA_DATA_HIGH_S   16U
#define FSI_RX_ECC_DATA_DATA_HIGH_M   0xFFFF0000U   // ECC Data Upper 16 Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_VAL register
//
//*************************************************************************************************
#define FSI_RX_ECC_VAL_ECC_VAL_S   0U
#define FSI_RX_ECC_VAL_ECC_VAL_M   0x7FU   // Computed ECC Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_LOG register
//
//*************************************************************************************************
#define FSI_RX_ECC_LOG_SBE   0x1U   // Single Bit Error Detected
#define FSI_RX_ECC_LOG_MBE   0x2U   // Multiple Bit Errors Detected

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_FRAME_TAG_CMP register
//
//*************************************************************************************************
#define FSI_RX_FRAME_TAG_CMP_TAG_REF_S      0U
#define FSI_RX_FRAME_TAG_CMP_TAG_REF_M      0xFU     // Frame Tag Reference
#define FSI_RX_FRAME_TAG_CMP_TAG_MASK_S     4U
#define FSI_RX_FRAME_TAG_CMP_TAG_MASK_M     0xF0U    // Frame Tag Mask
#define FSI_RX_FRAME_TAG_CMP_CMP_EN         0x100U   // Frame Tag Compare Enable
#define FSI_RX_FRAME_TAG_CMP_BROADCAST_EN   0x200U   // Broadcast Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_PING_TAG_CMP register
//
//*************************************************************************************************
#define FSI_RX_PING_TAG_CMP_TAG_REF_S      0U
#define FSI_RX_PING_TAG_CMP_TAG_REF_M      0xFU     // Ping Tag Reference
#define FSI_RX_PING_TAG_CMP_TAG_MASK_S     4U
#define FSI_RX_PING_TAG_CMP_TAG_MASK_M     0xF0U    // Ping Tag Mask
#define FSI_RX_PING_TAG_CMP_CMP_EN         0x100U   // Ping Tag Compare Enable
#define FSI_RX_PING_TAG_CMP_BROADCAST_EN   0x200U   // Broadcast Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_TRIG_CTRL_0 register
//
//*************************************************************************************************
#define FSI_RX_TRIG_CTRL_0_TRIG_EN         0x1U          // Enable Trigger Function
#define FSI_RX_TRIG_CTRL_0_TRIG_SEL_S      1U
#define FSI_RX_TRIG_CTRL_0_TRIG_SEL_M      0x1EU         // Input Select for Trigger
#define FSI_RX_TRIG_CTRL_0_RX_TRIG_DLY_S   8U
#define FSI_RX_TRIG_CTRL_0_RX_TRIG_DLY_M   0xFFFFFF00U   // Delay for Trigger generation

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_TRIG_WIDTH_0 register
//
//*************************************************************************************************
#define FSI_RX_TRIG_WIDTH_0_RX_TRIG_WIDTH_S   0U
#define FSI_RX_TRIG_WIDTH_0_RX_TRIG_WIDTH_M   0xFFFFU   // Output Pulse Width

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_DLYLINE_CTRL register
//
//*************************************************************************************************
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_S   0U
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_M   0x1FU     // Delay Line Tap Select for RXCLK
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_S    5U
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_M    0x3E0U    // Delay Line Tap Select for RXD0
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_S    10U
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_M    0x7C00U   // Delay Line Tap Select for RXD1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_TRIG_CTRL_1 register
//
//*************************************************************************************************
#define FSI_RX_TRIG_CTRL_1_TRIG_EN         0x1U          // Enable Trigger Function
#define FSI_RX_TRIG_CTRL_1_TRIG_SEL_S      1U
#define FSI_RX_TRIG_CTRL_1_TRIG_SEL_M      0x1EU         // Input Select for Trigger
#define FSI_RX_TRIG_CTRL_1_RX_TRIG_DLY_S   8U
#define FSI_RX_TRIG_CTRL_1_RX_TRIG_DLY_M   0xFFFFFF00U   // Delay for Trigger generation

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_TRIG_CTRL_2 register
//
//*************************************************************************************************
#define FSI_RX_TRIG_CTRL_2_TRIG_EN         0x1U          // Enable Trigger Function
#define FSI_RX_TRIG_CTRL_2_TRIG_SEL_S      1U
#define FSI_RX_TRIG_CTRL_2_TRIG_SEL_M      0x1EU         // Input Select for Trigger
#define FSI_RX_TRIG_CTRL_2_RX_TRIG_DLY_S   8U
#define FSI_RX_TRIG_CTRL_2_RX_TRIG_DLY_M   0xFFFFFF00U   // Delay for Trigger generation

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_TRIG_CTRL_3 register
//
//*************************************************************************************************
#define FSI_RX_TRIG_CTRL_3_TRIG_EN         0x1U          // Enable Trigger Function
#define FSI_RX_TRIG_CTRL_3_TRIG_SEL_S      1U
#define FSI_RX_TRIG_CTRL_3_TRIG_SEL_M      0x1EU         // Input Select for Trigger
#define FSI_RX_TRIG_CTRL_3_RX_TRIG_DLY_S   8U
#define FSI_RX_TRIG_CTRL_3_RX_TRIG_DLY_M   0xFFFFFF00U   // Delay for Trigger generation

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_VIS_1 register
//
//*************************************************************************************************
#define FSI_RX_VIS_1_RX_CORE_STS   0x8U   // Receiver Core Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_UDATA_FILTER register
//
//*************************************************************************************************
#define FSI_RX_UDATA_FILTER_UDATA_REF_S    0U
#define FSI_RX_UDATA_FILTER_UDATA_REF_M    0xFFU     // UserData reference value
#define FSI_RX_UDATA_FILTER_UDATA_MASK_S   8U
#define FSI_RX_UDATA_FILTER_UDATA_MASK_M   0xFF00U   // UserData mask  value



#endif
